RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_1xxxx_FWLib/library/HT32F1xxxx_Driver/inc/ht32f1xxxx_gpio.h
/*********************************************************************************************************//**
 * @file    ht32f1xxxx_gpio.h
 * @version $Rev:: 2971         $
 * @date    $Date:: 2023-10-25 #$
 * @brief   The header file of the GPIO and AFIO library.
 *************************************************************************************************************
 * @attention
 *
 * Firmware Disclaimer Information
 *
 * 1. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, which is supplied by Holtek Semiconductor Inc., (hereinafter referred to as "HOLTEK") is the
 *    proprietary and confidential intellectual property of HOLTEK, and is protected by copyright law and
 *    other intellectual property laws.
 *
 * 2. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, is confidential information belonging to HOLTEK, and must not be disclosed to any third parties
 *    other than HOLTEK and the customer.
 *
 * 3. The program technical documentation, including the code, is provided "as is" and for customer reference
 *    only. After delivery by HOLTEK, the customer shall use the program technical documentation, including
 *    the code, at their own risk. HOLTEK disclaims any expressed, implied or statutory warranties, including
 *    the warranties of merchantability, satisfactory quality and fitness for a particular purpose.
 *
 * <h2><center>Copyright (C) Holtek Semiconductor Inc. All rights reserved</center></h2>
 ************************************************************************************************************/

/* Define to prevent recursive inclusion -------------------------------------------------------------------*/
#ifndef __HT32F1XXXX_GPIO_H
#define __HT32F1XXXX_GPIO_H

#ifdef __cplusplus
 extern "C" {
#endif

/* Includes ------------------------------------------------------------------------------------------------*/
#include "ht32.h"

/** @addtogroup HT32F1xxxx_Peripheral_Driver HT32F1xxxx Peripheral Driver
  * @{
  */

/** @addtogroup GPIO
  * @{
  */


/* Settings ------------------------------------------------------------------------------------------------*/
/** @defgroup GPIO_Settings GPIO settings
  * @{
  */
#ifndef AUTO_CK_CONTROL
#define AUTO_CK_CONTROL      (0)
#endif
/**
  * @}
  */

/* Exported types ------------------------------------------------------------------------------------------*/
/** @defgroup GPIO_Exported_Types GPIO exported types
  * @{
  */

/**
 * @brief  Enumeration of GPIO pull resistor.
 */
typedef enum
{
  GPIO_PR_UP = 0,        /*!< weak pull-up resistor                                                         */
  GPIO_PR_DOWN,          /*!< weak pull-down resistor                                                       */
  GPIO_PR_DISABLE        /*!< Tri-state                                                                     */
} GPIO_PR_Enum;
/**
 * @brief  Enumeration of GPIO output drive current.
 */
typedef enum
{
  GPIO_DV_4MA = 0,   /*!<  4mA source/sink current                                                          */
  GPIO_DV_8MA,       /*!<  8mA source/sink current                                                          */
  #if (LIBCFG_GPIO_DV_4_8MA_ONLY)
  #else
  GPIO_DV_12MA,      /*!< 12mA source/sink current                                                          */
  GPIO_DV_16MA       /*!< 16mA source/sink current                                                          */
  #endif
} GPIO_DV_Enum;
/**
 * @brief  Enumeration of GPIO direction.
 */
typedef enum
{
  GPIO_DIR_IN = 0,    /*!< input mode                                                                       */
  GPIO_DIR_OUT        /*!< output mode                                                                      */
} GPIO_DIR_Enum;
/**
 * @brief  Enumeration of GPIO port source for EXTI channel.
 */
typedef enum
{
  AFIO_ESS_PA = 0,  /*!< EXTI channel x source come from GPIO Port A                                        */
  AFIO_ESS_PB = 1,  /*!< EXTI channel x source come from GPIO Port B                                        */
  AFIO_ESS_PC = 2,  /*!< EXTI channel x source come from GPIO Port C                                        */
  AFIO_ESS_PD = 3,  /*!< EXTI channel x source come from GPIO Port D                                        */
#if (LIBCFG_GPIOE)
  AFIO_ESS_PE = 4,  /*!< EXTI channel x source come from GPIO Port E                                        */
#endif
#if (LIBCFG_GPIOF)
  AFIO_ESS_PF = 5   /*!< EXTI channel x source come from GPIO Port F                                        */
#endif
} AFIO_ESS_Enum;
/**
 * @brief  Enumeration of AFIO for EXTI channel.
 */
typedef enum
{
  AFIO_EXTI_CH_0 = 0,     /*!< GPIO pin 0                                                                   */
  AFIO_EXTI_CH_1,         /*!< GPIO pin 1                                                                   */
  AFIO_EXTI_CH_2,         /*!< GPIO pin 2                                                                   */
  AFIO_EXTI_CH_3,         /*!< GPIO pin 3                                                                   */
  AFIO_EXTI_CH_4,         /*!< GPIO pin 4                                                                   */
  AFIO_EXTI_CH_5,         /*!< GPIO pin 5                                                                   */
  AFIO_EXTI_CH_6,         /*!< GPIO pin 6                                                                   */
  AFIO_EXTI_CH_7,         /*!< GPIO pin 7                                                                   */
  AFIO_EXTI_CH_8,         /*!< GPIO pin 8                                                                   */
  AFIO_EXTI_CH_9,         /*!< GPIO pin 9                                                                   */
  AFIO_EXTI_CH_10,        /*!< GPIO pin 10                                                                  */
  AFIO_EXTI_CH_11,        /*!< GPIO pin 11                                                                  */
  AFIO_EXTI_CH_12,        /*!< GPIO pin 12                                                                  */
  AFIO_EXTI_CH_13,        /*!< GPIO pin 13                                                                  */
  AFIO_EXTI_CH_14,        /*!< GPIO pin 14                                                                  */
  AFIO_EXTI_CH_15         /*!< GPIO pin 15                                                                  */
} AFIO_EXTI_CH_Enum;
/**
 * @brief Enumeration of AFIO_MODE.
 */
typedef enum
{
 AFIO_MODE_DEFAULT = 0,   /*!< Default AFIO mode                                                            */
 AFIO_MODE_1,             /*!< AFIO mode 1                                                                  */
 AFIO_MODE_2,             /*!< AFIO mode 2                                                                  */
 AFIO_MODE_3,             /*!< AFIO mode 3                                                                  */
 AFIO_MODE_4,             /*!< AFIO mode 4                                                                  */
 AFIO_MODE_5,             /*!< AFIO mode 5                                                                  */
 AFIO_MODE_6,             /*!< AFIO mode 6                                                                  */
 AFIO_MODE_7,             /*!< AFIO mode 7                                                                  */
 AFIO_MODE_8,             /*!< AFIO mode 8                                                                  */
 AFIO_MODE_9,             /*!< AFIO mode 9                                                                  */
 AFIO_MODE_10,            /*!< AFIO mode 10                                                                 */
 AFIO_MODE_11,            /*!< AFIO mode 11                                                                 */
 AFIO_MODE_12,            /*!< AFIO mode 12                                                                 */
 AFIO_MODE_13,            /*!< AFIO mode 13                                                                 */
 AFIO_MODE_14,            /*!< AFIO mode 14                                                                 */
 AFIO_MODE_15             /*!< AFIO mode 15                                                                 */
} AFIO_MODE_Enum;
/**
  * @}
  */

