RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_1xxxx_FWLib/library/HT32F1xxxx_Driver/inc/ht32f1xxxx_gpio.h
/* Definitions of AFIO_PIN                                                                                  */
#define AFIO_PIN_0    0x0001   /*!< AFIO pin 0 selected                                                     */
#define AFIO_PIN_1    0x0002   /*!< AFIO pin 1 selected                                                     */
#define AFIO_PIN_2    0x0004   /*!< AFIO pin 2 selected                                                     */
#define AFIO_PIN_3    0x0008   /*!< AFIO pin 3 selected                                                     */
#define AFIO_PIN_4    0x0010   /*!< AFIO pin 4 selected                                                     */
#define AFIO_PIN_5    0x0020   /*!< AFIO pin 5 selected                                                     */
#define AFIO_PIN_6    0x0040   /*!< AFIO pin 6 selected                                                     */
#define AFIO_PIN_7    0x0080   /*!< AFIO pin 7 selected                                                     */
#define AFIO_PIN_8    0x0100   /*!< AFIO pin 8 selected                                                     */
#define AFIO_PIN_9    0x0200   /*!< AFIO pin 9 selected                                                     */
#define AFIO_PIN_10   0x0400   /*!< AFIO pin 10 selected                                                    */
#define AFIO_PIN_11   0x0800   /*!< AFIO pin 11 selected                                                    */
#define AFIO_PIN_12   0x1000   /*!< AFIO pin 12 selected                                                    */
#define AFIO_PIN_13   0x2000   /*!< AFIO pin 13 selected                                                    */
#define AFIO_PIN_14   0x4000   /*!< AFIO pin 14 selected                                                    */
#define AFIO_PIN_15   0x8000   /*!< AFIO pin 15 selected                                                    */
#define AFIO_PIN_ALL  0xFFFF   /*!< All AFIO pins selected                                                  */

/* Definitions of GPIO_PIN_NUM                                                                              */
#define GPIO_PIN_NUM_0    0x00   /*!< GPIO pin number 0 selected                                            */
#define GPIO_PIN_NUM_1    0x01   /*!< GPIO pin number 1 selected                                            */
#define GPIO_PIN_NUM_2    0x02   /*!< GPIO pin number 2 selected                                            */
#define GPIO_PIN_NUM_3    0x03   /*!< GPIO pin number 3 selected                                            */
#define GPIO_PIN_NUM_4    0x04   /*!< GPIO pin number 4 selected                                            */
#define GPIO_PIN_NUM_5    0x05   /*!< GPIO pin number 5 selected                                            */
#define GPIO_PIN_NUM_6    0x06   /*!< GPIO pin number 6 selected                                            */
#define GPIO_PIN_NUM_7    0x07   /*!< GPIO pin number 7 selected                                            */
#define GPIO_PIN_NUM_8    0x08   /*!< GPIO pin number 8 selected                                            */
#define GPIO_PIN_NUM_9    0x09   /*!< GPIO pin number 9 selected                                            */
#define GPIO_PIN_NUM_10   0x0A   /*!< GPIO pin number 10 selected                                           */
#define GPIO_PIN_NUM_11   0x0B   /*!< GPIO pin number 11 selected                                           */
#define GPIO_PIN_NUM_12   0x0C   /*!< GPIO pin number 12 selected                                           */
#define GPIO_PIN_NUM_13   0x0D   /*!< GPIO pin number 13 selected                                           */
#define GPIO_PIN_NUM_14   0x0E   /*!< GPIO pin number 14 selected                                           */
#define GPIO_PIN_NUM_15   0x0F   /*!< GPIO pin number 15 selected                                           */

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------------------------------------*/
/** @defgroup GPIO_Exported_Macro GPIO exported macro
  * @{
  */
/* check parameter of the GPIOx                                                                             */
#define IS_GPIO(x)           (IS_GPIOABCD(x) || IS_GPIOE(x) || IS_GPIOF(x))
#define IS_GPIOABCD(x)       ((x==HT_GPIOA) || (x==HT_GPIOB) || (x==HT_GPIOC) || (x==HT_GPIOD))
#if (LIBCFG_GPIOE)
#define IS_GPIOE(x)          (x == HT_GPIOE)
#else
#define IS_GPIOE(x)          (0)
#endif
#if (LIBCFG_GPIOF)
#define IS_GPIOF(x)          (x == HT_GPIOF)
#else
#define IS_GPIOF(x)          (0)
#endif

/* check parameter of the GPIO_Px                                                                           */
#define IS_GPIO_PORT(x)           (IS_GPIO_PORT1(x) || IS_GPIO_PORT2(x) || IS_GPIO_PORT3(x) || IS_GPIO_PORT4(x) || IS_GPIO_PORT5(x))

#define IS_GPIO_PORT1(x)          ((x == GPIO_PA) || (x == GPIO_PB) )

#define IS_GPIO_PORT2(x)          (x == GPIO_PC)

#define IS_GPIO_PORT3(x)          (x == GPIO_PD)

#if (LIBCFG_GPIOE)
#define IS_GPIO_PORT4(x)          (x == GPIO_PE)
#else
#define IS_GPIO_PORT4(x)          (0)
#endif
#if (LIBCFG_GPIOF)
#define IS_GPIO_PORT5(x)          (x == GPIO_PF)
#else
#define IS_GPIO_PORT5(x)          (0)
#endif

/* check parameter of the GPIO_PIN_NUM                                                                       */
#define IS_GPIO_PIN_NUM(x)        (x < 16)

/* check parameter of the GPIOx pull resistor                                                               */
#define IS_GPIO_PR(x)        (((x) == GPIO_PR_UP) || ((x) == GPIO_PR_DOWN) || ((x) == GPIO_PR_DISABLE))

/* check parameter of the GPIOx driving current                                                             */
#if (LIBCFG_GPIO_DV_4_8MA_ONLY)
#define IS_GPIO_DV_12_16MA(x)       (0)
#else
#define IS_GPIO_DV_12_16MA(x)       (((x) == GPIO_DV_12MA) || ((x) == GPIO_DV_16MA))
#endif
#define IS_GPIO_DV(x)        (((x) == GPIO_DV_4MA) || ((x) == GPIO_DV_8MA) || IS_GPIO_DV_12_16MA(x))

/* check parameter of the GPIOx input/output direction                                                      */
#define IS_GPIO_DIR(x)       (((x) == GPIO_DIR_IN) || ((x) == GPIO_DIR_OUT) )

/* check parameter of the EXTI source port                                                                  */
#if (LIBCFG_GPIOE)
#define IS_ESSE(x)           (x == AFIO_ESS_PE)
#else
#define IS_ESSE(x)           (0)
#endif
#if (LIBCFG_GPIOF)
#define IS_ESSF(x)           (x == AFIO_ESS_PF)
#else
#define IS_ESSF(x)           (0)
#endif

#define IS_AFIO_ESS(x)       ((x == AFIO_ESS_PA) || (x == AFIO_ESS_PB) || (x == AFIO_ESS_PC) || (x == AFIO_ESS_PD) || IS_ESSE(x) || IS_ESSF(x))

